УТ_для_edt/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОтгрузкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОформлениюГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКСборкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобираетсяГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобраноГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/СостоянияЭД/СостоянияЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЭД</name>
  <resources>
    <name>СостояниеВерсииЭД</name>
    <type>
      <types>EnumRef.СостоянияВерсийЭД</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DocumentRef.ЭлектронныйДокументВходящий</types>
      <types>DocumentRef.ЭлектронныйДокументИсходящий</types>
      <types>CatalogRef.ЭДПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ДействияСНашейСтороны</name>
    <comment>Признак необходимости выполнения какого-либо действия с ЭД с нашей стороны</comment>
    <type>
      <types>EnumRef.СводныеСостоянияЭД</types>
    </type>
  </resources>
  <resources>
    <name>ДействияСоСтороныДругогоУчастника</name>
    <comment>Признак ожидания выполнения какого-либо действия со стороны другого участника ЭД</comment>
    <type>
      <types>EnumRef.СводныеСостоянияЭД</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентБЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DefinedType.ОснованияЭлектронныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/РасчетыСКлиентами/РасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОплате</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Оплачивается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Отгружается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуКлиенту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродажаПоЗаказу</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <comment>Заполняется для реализации товаров и услуг</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключатьПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗалогЗаТару</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗачетаПоДатеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОплаты</name>
    <type>
      <types>EnumRef.ВариантыОплатыКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DefinedType.ОбъектРасчетовСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ЗаказыКлиентов/ЗаказыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыКлиентов</name>
  <resources>
    <name>Заказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовКлиентов</name>
  <enumValues>
    <name>ОжидаетсяСогласование</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяАвансДоОбеспечения</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПредоплатаДоОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОбеспечение</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОплатаПослеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ГотовКЗакрытию</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ВариантыОплатыКлиентом/ВариантыОплатыКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОплатыКлиентом</name>
  <enumValues>
    <name>АвансДоОбеспечения</name>
  </enumValues>
  <enumValues>
    <name>ПредоплатаДоОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>КредитПослеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>КредитСдвиг</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРасчетов</name>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/CommonModules/Модуль_Б1Сервер/Module.bsl
Функция ПолучитьМассивСостояний() Экспорт
	
	МассивСостояний = Новый Массив();
	МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяАвансДоОбеспечения);
	МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяПредоплатаДоОтгрузки);
	МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки);	
	Возврат МассивСостояний;
	
КонецФункции

Функция ПолучитьЧерныйсписокПартнеров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НеплатящиеПартнеры.Партнер
		|ИЗ
		|	РегистрСведений.НеплатящиеПартнеры КАК НеплатящиеПартнеры";

	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
	МассивПартнеры = Новый Массив;
	Пока Выборка.Следующий()Цикл
		МассивПартнеры.Добавить(Выборка.Партнер);
	КонецЦикла;	
	Возврат МассивПартнеры;
	
КонецФункции

//Функция ПолучитьМассивПросроченныхПоОплатеЗаказов()Экспорт
//	
//	Дата = ТекущаяДата() - Константы.КоличествоДнейПросрочкиОплаты.Получить()*86400;
//		
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	МИНИМУМ(ТоварыКОтгрузкеОстаткиИОбороты.Период) КАК Период,
//		|	ДвижениеТоваров.Распоряжение КАК Ссылка
//		|ИЗ
//		|	РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(, &Дата, Регистратор, , ) КАК ТоварыКОтгрузкеОстаткиИОбороты
//		|		ПО ДвижениеТоваров.Номенклатура = ТоварыКОтгрузкеОстаткиИОбороты.Номенклатура
//		|			И ДвижениеТоваров.Регистратор = ТоварыКОтгрузкеОстаткиИОбороты.ДокументОтгрузки
//		|			И ДвижениеТоваров.Характеристика = ТоварыКОтгрузкеОстаткиИОбороты.Характеристика
//		|			И ДвижениеТоваров.Склад = ТоварыКОтгрузкеОстаткиИОбороты.Склад
//		|ГДЕ
//		|	ТоварыКОтгрузкеОстаткиИОбороты.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
//		|	И ТоварыКОтгрузкеОстаткиИОбороты.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
//		|	//И ДвижениеТоваров.Распоряжение В(&ТаблицаЗаказов)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ДвижениеТоваров.Распоряжение";

//	Запрос.УстановитьПараметр("Дата", Дата);
//	

//	Результат = Запрос.Выполнить();

//	Выборка = Результат.Выбрать();
//	//МассивПросроченныхПоОплатеЗаказов.Колонки.Удалить("Период");
//	
//	МассивПросроченныхПоОплатеЗаказов = Новый Массив;
//	Пока Выборка.Следующий()Цикл
//		МассивПросроченныхПоОплатеЗаказов.Добавить(Выборка.Ссылка);
//	КонецЦикла;	
//	Возврат МассивПросроченныхПоОплатеЗаказов;
//	
//КонецФункции

//Функция ПроверитьДолгКлиента(Документы, Список = Ложь) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапросаПроверитьДолгКлиента();
//		"ВЫБРАТЬ
//		|	ДокументЗаказКлиента.Ссылка КАК Ссылка,
//		|	ВЫБОР
//		|		КОГДА ДокументЗаказКлиента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
//		|				И ДокументЗаказКлиента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
//		|				И ДокументЗаказКлиента.Проведен
//		|				И ДокументЗаказКлиента.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
//		|				И ДокументЗаказКлиента.СуммаДокумента > 0
//		|			ТОГДА ВЫРАЗИТЬ((ДокументЗаказКлиента.СуммаДокумента - ЕСТЬNULL(РасчетыСКлиентамиОстатки.КОплатеОстаток, 0)) * 100 / ДокументЗаказКлиента.СуммаДокумента КАК ЧИСЛО(15, 0))
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК ПроцентОплаты
//		|ПОМЕСТИТЬ Таблица
//		|ИЗ
//		|	Документ.ЗаказКлиента КАК ДокументЗаказКлиента
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭД КАК СостоянияЭД
//		|		ПО (СостоянияЭД.СсылкаНаОбъект = ДокументЗаказКлиента.Ссылка)
//		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки КАК РасчетыСКлиентамиОстатки
//		|		ПО ДокументЗаказКлиента.Ссылка = РасчетыСКлиентамиОстатки.ЗаказКлиента
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки(КОНЕЦПЕРИОДА(&ДатаАктуальности, ДЕНЬ), ) КАК РасчетыСКлиентамиОстаткиНаДатуАктуальности
//		|		ПО ДокументЗаказКлиента.Ссылка = РасчетыСКлиентамиОстаткиНаДатуАктуальности.ЗаказКлиента
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов.Остатки КАК ЗаказыКлиентовОстатки
//		|		ПО ДокументЗаказКлиента.Ссылка = ЗаказыКлиентовОстатки.ЗаказКлиента
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов.Остатки(КОНЕЦПЕРИОДА(&ДатаАктуальности, ДЕНЬ), ) КАК ЗаказыКлиентовОстаткиНаДатуАктуальности
//		|		ПО ДокументЗаказКлиента.Ссылка = ЗаказыКлиентовОстаткиНаДатуАктуальности.ЗаказКлиента}
//		|ГДЕ
//		|	ДокументЗаказКлиента.Ссылка В(&Документы)
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	Таблица.Ссылка,
//		|	Таблица.ПроцентОплаты
//		|ПОМЕСТИТЬ ВыходнаяТаблица
//		|ИЗ
//		|	Таблица КАК Таблица
//		|ГДЕ
//		|	Таблица.ПроцентОплаты < 98.5
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВыходнаяТаблица.Ссылка
//		|ИЗ
//		|	ВыходнаяТаблица КАК ВыходнаяТаблица";
//	Запрос.УстановитьПараметр("Документы", Документы);
//	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДата());

//	Результат = Запрос.Выполнить();

//	Если Список Тогда
//		//Результат = Запрос.ВыполнитьПакет();
//		МассивДокументов = Новый Массив;
//		//МассивДокументов = Результат[0];
//		Выборка = Результат.Выбрать();
//		Пока Выборка.Следующий() Цикл
//			МассивДокументов.Добавить(Выборка.Ссылка);
//		КонецЦикла;
//		//МассивДокументов = Результат.Выгрузить();
//		
//		Возврат МассивДокументов;
//	КонецЕсли;
//	
//	
//	
//	Если Результат.Пустой()  Тогда
//		Возврат Истина;
//	ИначеЕсли ПроверитьПолныеПраваТекПользователя() Тогда
//		Возврат Истина;
//	ИначеЕсли РольДоступна(Метаданные.Роли.ДобавлениеИзменениеДокументовРегламентированногоУчета) И ПроверитьНаличиеКредита(Документы) Тогда
//		Возврат Истина;	
//	Иначе	
//		Возврат Ложь;
//	КонецЕсли;	
//	//ВыборкаДетальныеЗаписи = Результат.Выбрать();
//	
//КонецФункции	

//Функция ПроверитьДоступностьСтатуса() Экспорт
//	
//	Возврат РольДоступна(Метаданные.Роли.ДобавлениеИзменениеДокументовРегламентированногоУчета);
//	
//КонецФункции	

Функция ПроверитьПолныеПраваТекПользователя() Экспорт
	
	Возврат РольДоступна(Метаданные.Роли.ПолныеПрава);
	
КонецФункции	

Функция ПроверитьВозможностьЗакрытияДокументов(Документы) Экспорт
	      
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
		|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток,
		|	ТоварыКОтгрузкеОстатки.СобираетсяОстаток,
		|	ТоварыКОтгрузкеОстатки.СобраноОстаток,
		|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(&Период, ДокументОтгрузки.ЗаказКлиента В (&Документы)) КАК ТоварыКОтгрузкеОстатки
		|ГДЕ
		|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
		|	И ТоварыКОтгрузкеОстатки.ДокументОтгрузки.ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА";
		
	//Запрос.Текст = Запрос.Текст +  ТекстЗапросаПроверитьДолгКлиента();
	
	Запрос.УстановитьПараметр("Документы", Документы);
	//Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДата());
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));

	Результат = Запрос.Выполнить();

	//Если Список Тогда
		//Результат = Запрос.ВыполнитьПакет();
		МассивДокументов = Новый Массив;
		//МассивДокументов = Результат[0];
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДокументов.Добавить(Выборка.ЗаказКлиента);
		КонецЦикла;
		//МассивДокументов = Результат.Выгрузить();
		
		Возврат МассивДокументов;
	//КонецЕсли;
	
	
	
	//Если Результат.Пустой()  Тогда
	//	Возврат Истина;
	//ИначеЕсли ПроверитьПолныеПраваТекПользователя() Тогда
	//	Возврат Истина;
	//Иначе	
	//	Возврат Ложь;
	//КонецЕсли;	
	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	
    	
КонецФункции

Процедура ЗапретитьВозможностьПроведенияДокументовПоЗакрытымЗаказам(Заказы, Отказ) Экспорт
	
	Если ПроверитьПолныеПраваТекПользователя() Тогда
		Возврат; //Ложь;
	КонецЕсли;
	//Проверим, закрыты ли заказы. Если закрыты проводить нельзя - вернем занчение Истина.
	
	 	
	Для каждого Заказ ИЗ Заказы Цикл
		Если Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		  ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + Заказ + " Закрыт.",,,,Отказ);
		  Если Отказ Тогда
			  Прервать;
		  КонецЕсли;  
		КонецЕсли;  
	КонецЦикла;	
	
КонецПроцедуры

// Модуль_Б1Сервер.ВыгрузитьТЗВЭксель(Таблица)

Функция ВыгрузитьТЗВЭксель(Таблица) Экспорт
	
	
	//Колонки = Таблица.Колонки;
	Значение = "ВыгрузкаТаблицыЗначений";
	ИмяФайла = "d:\" + Значение + ".xls";
	
	//ТП = Новый ТаблицаЗначений;
	//ТП.Очистить();
	//
	//// Добавим предопределенные реквизиты справочника
	//ТП.Колонки.Добавить(Таблица.Колонки);
	//стр = ТП.Добавить();
	//стр.НазваниеРеквизита = "НаименованиеПолное";
	//стр = ТП.Добавить();
	//стр.НазваниеРеквизита = "Наименование";
	//
	//// Добавим реквизит родитель для справочников с установленным видом Иерархии
	////Если Строка(КоллекцияРеквизитов.ВидИерархии) = "ИерархияГруппИЭлементов" Тогда
	//	стр = ТП.Добавить();
	//	стр.НазваниеРеквизита = "ИНН";
	////КонецЕсли;
	//
	//// Если справочник подчиненный, добавим реквизит владелец
	////Если КоллекцияРеквизитов.Владельцы.Количество() Тогда
	//	стр = ТП.Добавить();
	//	стр.НазваниеРеквизита = "КПП";
	////КонецЕсли;
	//
	//// Обход коллекции реквизитов метаданных для формирования табличного поля выбора
	////Для каждого пРек из КоллекцияРеквизитов.Реквизиты Цикл
	////	стр = ТП.Добавить();
	////	стр.НазваниеРеквизита = пРек.Имя;
	////КонецЦикла;
	////
	////// Поставим заначение истина для всех реквизитов справочника
	////Для каждого стр из ТП Цикл
	////	стр.Выгружать = истина;
	////КонецЦикла;

	Попытка
		
		Попытка
	 		// Загрузка Microsoft Excel
	 		Сообщить("Выгрузка данных из 1С в Microsoft Excel...");
	 		ExcelПриложение = Новый COMОбъект("Excel.Application");
		Исключение
	 		Сообщить("Ошибка при загрузке Microsoft Excel." 
				+ Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
	 		Возврат Ложь;
		КонецПопытки;
		
		// Создадим книгу, по умолчанию в ней уже есть листы
		Книга = ExcelПриложение.WorkBooks.Add();
		
		// Используем первый лист книги Excel
		Лист = Книга.WorkSheets(1);
		
		// Сформировать шапку документа в первой строке листа
		НомерКолонки = 1;
		
		КоличествоКолонок = Таблица.Колонки.Количество();
		Для каждого Колонка из Таблица.Колонки цикл
		//	Если стр.Выгружать Тогда
				Лист.Cells(1, НомерКолонки).Value = Колонка.Имя;
				//Лист.Cells(1, 2).Value = "Наименование";
				//Лист.Cells(1, 3).Value = "ИНН";
				//Лист.Cells(1, 4).Value = "КПП";
				НомерКолонки = НомерКолонки + 1;
			//КонецЕсли;
		КонецЦикла;

		// Выгрузить данные справочника
		
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ //ПЕРВЫЕ 60
	//	|	ПОДСТРОКА(Контрагенты.НаименованиеПолное, 0, 3) КАК Наименование,
	//	|	Контрагенты.НаименованиеПолное,
	//	|	Контрагенты.Ссылка
	//	|ПОМЕСТИТЬ ООО
	//	|ИЗ
	//	|	Справочник.Контрагенты КАК Контрагенты
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ООО.НаименованиеПолное,
	//	|	ООО.Наименование,
	//	|	ООО.Ссылка
	//	|ИЗ
	//	|	ООО КАК ООО
	//	|ГДЕ
	//	|	(ООО.Наименование = ""ООО""
	//	|			ИЛИ ООО.Наименование = ""ЗАО""
	//	|			ИЛИ ООО.Наименование = ""ОАО"")";

	//Результат = Запрос.Выполнить();

	//Выборка = Результат.Выбрать();

	//Пока Выборка.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		//выборка = Справочники[ИмяСправочника].Выбрать();
		КоличествоСтрокВТаблице = Таблица.Количество();
		СтрокаЛиста = 2;
		Для каждого Стр Из Таблица Цикл
			НомерКолонки = 1;
			Для Каждого Колонка из Таблица.Колонки цикл
			//	Если стр.Выгружать Тогда
					Попытка
						// Установим значение в строке и колонке
						Если ТипЗнч(Стр[Колонка.Имя])=Тип("Число") Тогда
							// Установним формат для типа Число
							Лист.Cells(СтрокаЛиста, НомерКолонки).NumberFormat = "0";
							Лист.Cells(СтрокаЛиста, НомерКолонки).Value = 
									Формат(Стр[Колонка.Имя],"ЧГ=0");
						иначе
							// Для всех других типов установим формат "Текстовый"
							Лист.Cells(СтрокаЛиста, НомерКолонки).NumberFormat = "@";
							Лист.Cells(СтрокаЛиста, НомерКолонки).Value = 
									Строка(Стр[Колонка.Имя]);
						КонецЕсли;
					исключение
						// Если значение реквизита справочника постое
						Сообщить("Ошибка установки значения для: " + 
							Стр[Колонка.Имя]);
						Сообщить("Стр: " +СтрокаЛиста+ " Кол: " + 
							Колонка+ " Рек: " + стр.НазваниеРеквизита);
					КонецПопытки;
					НомерКолонки = НомерКолонки + 1;
			//	КонецЕсли;
			КонецЦикла;
			СтрокаЛиста = СтрокаЛиста + 1;
			Сообщить("Экспорт из 1С в Excel " + СтрокаЛиста);
		КонецЦикла;
		
		// Сохраним созданныую книгу в файл xls
		Книга.SaveAs(имяФайла); 
		
		ExcelПриложение.Quit();
		
		// Записать xls файл 
		Сообщить("Файл выгружен успешно: "  + имяФайла );
	Исключение
		// Обработка ошибок экспорта данных из 1С в Excel
		Сообщить("Ошибка записи данных файла :" + имяФайла);
		Сообщить(ОписаниеОшибки());
		Попытка
			ExcelПриложение.Quit();
		Исключение
		КонецПопытки;
	КонецПопытки;

	
	Возврат Истина;
	
КонецФункции	

//Парптионный учет
Функция ИсключитьРаспределенныйТовар(Расходы) Экспорт
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Порядок,
	|	Таблица.ВидДвижения,
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.Организация,
	|	Таблица.АналитикаУчетаНоменклатуры,
	|	Таблица.АналитикаУчетаПродукции,
	|	Таблица.ДокументПоступления,
	|	Таблица.ДокументВыпуска,
	|	Таблица.АналитикаУчетаПартий,
	|	Таблица.ВидЗапасов,
	|	Таблица.НалогообложениеНДС,
	|	Таблица.Продукция,
	|	Таблица.Характеристика,
	|	Таблица.Склад,
	|	Таблица.КорОрганизация,
	|	Таблица.КорАналитикаУчетаПродукции,
	|	Таблица.КорПродукция,
	|	Таблица.КорХарактеристика,
	|	Таблица.КорСклад,
	|	Таблица.КорДокументВыпуска,
	|	Таблица.КорАналитикаУчетаПартий,
	|	Таблица.КорВидЗапасов,
	|	Таблица.КорКоличество,
	|	Таблица.КорНалогообложениеНДС,
	|	Таблица.СтатьяПотребления,
	|	Таблица.АналитикаПотребления,
	|	Таблица.Подразделение,
	|	Таблица.ДокументРеализации,
	|	Таблица.КоличествоТовара,
	|	Таблица.ЭтоПеремещение,
	|	Таблица.ЕстьВозвраты,
	|	Таблица.ЗаполнятьСуммыРегл,
	|	Таблица.МоментВремени,
	|	Таблица.НалогообложениеПартии,
	|	Таблица.Знаменатель,
	|	Таблица.Количество,
	|	Таблица.Стоимость,
	|	Таблица.СтоимостьБезНДС,
	|	Таблица.СтоимостьРегл,
	|	Таблица.НДСРегл,
	|	Таблица.Знак
	|ПОМЕСТИТЬ Расходы
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	НЕ Таблица.ДокументПоступления ЕСТЬ NULL ";
	Запрос.УстановитьПараметр("Таблица", Расходы);	

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецФункции

Функция ПроверитьНаличиеКредита(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
		|ГДЕ
		|	ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
		|	И ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Документ);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

Функция ТекстЗапросаПроверитьДолгКлиента() Экспорт
	
	//Текст = "ВЫБРАТЬ
	//	|	ДокументЗаказКлиента.Ссылка КАК Ссылка,
	//	|	ВЫБОР
	//	|		КОГДА ДокументЗаказКлиента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	//	|				И ДокументЗаказКлиента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	//	|				И ДокументЗаказКлиента.Проведен
	//	|				И ДокументЗаказКлиента.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	//	|				И ДокументЗаказКлиента.СуммаДокумента > 0
	//	|			ТОГДА ВЫРАЗИТЬ((ДокументЗаказКлиента.СуммаДокумента - ЕСТЬNULL(РасчетыСКлиентамиОстатки.КОплатеОстаток, 0)) * 100 / ДокументЗаказКлиента.СуммаДокумента КАК ЧИСЛО(15, 0))
	//	|		ИНАЧЕ 0
	//	|	КОНЕЦ КАК ПроцентОплаты
	//	|ПОМЕСТИТЬ Таблица
	//	|ИЗ
	//	|	Документ.ЗаказКлиента КАК ДокументЗаказКлиента
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭД КАК СостоянияЭД
	//	|		ПО (СостоянияЭД.СсылкаНаОбъект = ДокументЗаказКлиента.Ссылка)
	//	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки КАК РасчетыСКлиентамиОстатки
	//	|		ПО ДокументЗаказКлиента.Ссылка = РасчетыСКлиентамиОстатки.ЗаказКлиента
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки(КОНЕЦПЕРИОДА(&ДатаАктуальности, ДЕНЬ), ) КАК РасчетыСКлиентамиОстаткиНаДатуАктуальности
	//	|		ПО ДокументЗаказКлиента.Ссылка = РасчетыСКлиентамиОстаткиНаДатуАктуальности.ЗаказКлиента
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов.Остатки КАК ЗаказыКлиентовОстатки
	//	|		ПО ДокументЗаказКлиента.Ссылка = ЗаказыКлиентовОстатки.ЗаказКлиента
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов.Остатки(КОНЕЦПЕРИОДА(&ДатаАктуальности, ДЕНЬ), ) КАК ЗаказыКлиентовОстаткиНаДатуАктуальности
	//	|		ПО ДокументЗаказКлиента.Ссылка = ЗаказыКлиентовОстаткиНаДатуАктуальности.ЗаказКлиента}
	//	|ГДЕ
	//	|	ДокументЗаказКлиента.Ссылка В(&Документы)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	Таблица.Ссылка,
	//	|	Таблица.ПроцентОплаты
	//	|ПОМЕСТИТЬ ВыходнаяТаблица
	//	|ИЗ
	//	|	Таблица КАК Таблица
	//	|ГДЕ
	//	|	Таблица.ПроцентОплаты < 98.5
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВыходнаяТаблица.Ссылка
	//	|ИЗ
	//	|	ВыходнаяТаблица КАК ВыходнаяТаблица";
		
	Текст = "ВЫБРАТЬ
	        |	ВложенныйЗапрос.Ссылка
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ДокументЗаказКлиента.Ссылка КАК Ссылка,
	        |		ВЫБОР
	        |			КОГДА ДокументЗаказКлиента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	        |					И ДокументЗаказКлиента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
	        |					И ДокументЗаказКлиента.Проведен
	        |					И ДокументЗаказКлиента.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	        |				ТОГДА ВЫБОР
	        |						КОГДА ДокументЗаказКлиента.СуммаДокумента > 0
	        |							ТОГДА ВЫРАЗИТЬ((ДокументЗаказКлиента.СуммаДокумента - ЕСТЬNULL(РасчетыСКлиентамиОстатки.КОплатеОстаток, 0)) * 100 / ДокументЗаказКлиента.СуммаДокумента КАК ЧИСЛО(15, 0))
	        |						ИНАЧЕ ВЫБОР
	        |								КОГДА ДокументЗаказКлиента.СуммаДокумента = 0
	        |									ТОГДА 100
	        |							КОНЕЦ
	        |					КОНЕЦ
	        |			ИНАЧЕ 0
	        |		КОНЕЦ КАК ПроцентОплаты
	        |	ИЗ
	        |		Документ.ЗаказКлиента КАК ДокументЗаказКлиента
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭД КАК СостоянияЭД
	        |			ПО (СостоянияЭД.СсылкаНаОбъект = ДокументЗаказКлиента.Ссылка)
	        |			{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки КАК РасчетыСКлиентамиОстатки
	        |			ПО ДокументЗаказКлиента.Ссылка = РасчетыСКлиентамиОстатки.ЗаказКлиента
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки(КОНЕЦПЕРИОДА(&ДатаАктуальности, ДЕНЬ), ) КАК РасчетыСКлиентамиОстаткиНаДатуАктуальности
	        |			ПО ДокументЗаказКлиента.Ссылка = РасчетыСКлиентамиОстаткиНаДатуАктуальности.ЗаказКлиента
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов.Остатки КАК ЗаказыКлиентовОстатки
	        |			ПО ДокументЗаказКлиента.Ссылка = ЗаказыКлиентовОстатки.ЗаказКлиента
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов.Остатки(КОНЕЦПЕРИОДА(&ДатаАктуальности, ДЕНЬ), ) КАК ЗаказыКлиентовОстаткиНаДатуАктуальности
	        |			ПО ДокументЗаказКлиента.Ссылка = ЗаказыКлиентовОстаткиНаДатуАктуальности.ЗаказКлиента}
	        |	ГДЕ
	        |		ДокументЗаказКлиента.Ссылка В(&Документы)) КАК ВложенныйЗапрос
	        |ГДЕ
	        |	ВложенныйЗапрос.ПроцентОплаты < 98.5";
		
	Возврат Текст;
		
КонецФункции

#Область ДоработкиКаратеев

// Функция проверяет соответствие Организация и Контрагентов во всех подчиненных документах
&НаСервере
Функция ПроверитьЮрЛицНаСоответствиеСервер(Отказ, Объект) Экспорт

	СтруктураПодчиненности = Новый ТаблицаЗначений;
	СтруктураПодчиненности.Колонки.Добавить("Ссылка",,"Документ");
	СтруктураПодчиненности.Колонки.Добавить("Уровень",,"Уровень подчиенности");
	
	Стр = СтруктураПодчиненности.Добавить();
	Стр.Ссылка = Объект.Ссылка;
	Стр.Уровень = 0;
	
	// Получаем все подчиненные документы
	Для Каждого Строка Из СтруктураПодчиненности Цикл
		
		ЗначениеКритерияОтбора = Строка.Получить(0);
		
		Если Строка.Уровень <= 3 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СвязанныеДокументы.Ссылка КАК Ссылка
			|ИЗ
			|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Документ.ЗаказПоставщику)
			|	И ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Документ.ЗаказНаПеремещение)
			|	И ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Документ.ПриобретениеТоваровУслуг)
			|	И ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Документ.ПриобретениеУслугПрочихАктивов)
			//++ #Б-990 смарт: Лопато 23.09.2024 //ИМ. Подготовить метод подтверждения (отклонения) регистрации пользователя на сайте  
			|	И ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Задача.ЗадачаИсполнителя)
			//--#Б-990 смарт: Лопато 23.09.2024
			|	И ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Документ.смартЗаявкаНаПускоНаладку)";
			
			Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Стр = СтруктураПодчиненности.Добавить(); 
				Стр.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
				Стр.Уровень = Строка.Уровень + 1;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Стр Из СтруктураПодчиненности Цикл
		
		Если Не Стр.Уровень = 0 Тогда
			
			Документ = Стр.Получить(0);
			
			//++ #Б4348 смарт: Шляпников 15.09.2025 / Ошибка ЖР. Закрытие заказа клиента
			Если НЕ ЗначениеЗаполнено(Документ) Тогда
				Продолжить;
			ИначеЕсли НЕ ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Документ)) Тогда
				Продолжить;
			ИначеЕсли НЕ ОбщегоНазначения.ЭтоДокумент(Документ.Метаданные()) Тогда
				Продолжить;
			КонецЕсли;
			//-- #Б4348 смарт: Шляпников 15.09.2025
			
			Если Документ.Проведен Тогда
				
				ДокументОбъект = Документ.ПолучитьОбъект();
				
				Попытка // Проверка Организации и Контрагента
					
					Если Не ДокументОбъект.Организация = Объект.Организация Тогда
						Отказ = Истина;
						Сообщить("В документе: "+ДокументОбъект.Ссылка+" необходимо изменить Организацию");
					КонецЕсли;
					
					Если Не ДокументОбъект.Контрагент = Объект.Контрагент Тогда
						Отказ = Истина;
						Сообщить("В документе: "+ДокументОбъект.Ссылка+" необходимо изменить Контрагента");
					КонецЕсли;
					
				Исключение
					Продолжить;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат Отказ;
	
КонецФункции // ПроверитьЮрЛицНаСоответствиеСервер()

#КонецОбласти   

Функция ПолучитьТекущегоПользователя() Экспорт
	Возврат Пользователи.ТекущийПользователь();
КонецФункции

Функция ДоступныРоль_РазделПродажи(Пользователь) Экспорт
	Возврат Пользователи.РолиДоступны("РазделПродажи", Пользователь);
КонецФункции
